# CurveOverconstrained Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarShapeFailures..::..CurveOverconstrained Property
BuiltInFailures..::..RebarShapeFailures Class See Also
---
Segment is overconstrained. It has at least one parameterized dimension that conflicts with another dimension.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CurveOverconstrained { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CurveOverconstrained As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CurveOverconstrained {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarShapeFailures Class
Autodesk.Revit.DB Namespace